import React from 'react';

export default function IndustryIcon({ color = '#000' }) {
  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      id="Слой_1"
      data-name="Слой 1"
      width="54.4"
      height="52.4"
      viewBox="0 0 54.4 52.4"
      fill={color}
    >
      <script xmlns="" />
      <title>05_industry</title>
      <g>
        <path
          class="cls-1"
          d="M44,44.8H22a1.2,1.2,0,1,0,0,2.4H44a1.2,1.2,0,0,0,0-2.4Z"
          transform="translate(-12.64 -14.18)"
        />
        <path
          class="cls-1"
          d="M40.21,52.42H22a1.2,1.2,0,1,0,0,2.4H40.21a1.2,1.2,0,0,0,0-2.4Z"
          transform="translate(-12.64 -14.18)"
        />
        <path
          class="cls-1"
          d="M65,15.33a1.19,1.19,0,0,0-1.2-1.15H53.38a1.21,1.21,0,0,0-1.2,1.15L51.4,34.57l-18-6.08a1.21,1.21,0,0,0-1.09.17,1.19,1.19,0,0,0-.5,1v4.18L14.22,28a1.25,1.25,0,0,0-1.08.17,1.19,1.19,0,0,0-.5,1V63.48a3.11,3.11,0,0,0,3.12,3.1H63.91A3.13,3.13,0,0,0,67,63.43Zm-2.35,1.25.18,4.32H54.36l.17-4.32ZM15,63.48V30.79l17.59,5.82a1.2,1.2,0,0,0,1.57-1.14V31.3l17.1,5.76L50.21,64.18H15.76A.72.72,0,0,1,15,63.48Zm48.87.7H52.61l1.15-28.39h0l.5-12.49H63l1.67,40.18A.72.72,0,0,1,63.91,64.18Z"
          transform="translate(-12.64 -14.18)"
        />
      </g>
      <script xmlns="" />
    </svg>
  );
}
