import Car from '@/components/SvgIcons/Car';
import CommercialCar from '@/components/SvgIcons/CommercialCar';
import SpecialCar from '@/components/SvgIcons/SpecialCar';
import IndustryIcon from '@/components/SvgIcons/IndustryIcon';
import TransmissionIcon from '@/components/SvgIcons/TransmissionIcon';
import AntiFreezeIcon from '@/components/SvgIcons/AntiFreezeIcon';

import ekoilTara from '@/app/assets/ekoil-tara.png';
import ekoilTara2 from '@/app/assets/ekoil-tara2.png';
import ekoilTara3 from '@/app/assets/ekoil-tara3.png';
import ekoilTara4 from '@/app/assets/ekoil-tara4.png';

export const ITEMS = [
  {
    id: 1,
    name: 'Ekoil Asura',
    subtitle: 'RX 5W-30 ILSAC GF 5',
    img: ekoilTara,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  },
  {
    id: 2,
    name: 'Ekoil Sprinter',
    subtitle: '5W-30 C3',
    img: ekoilTara2,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  },
  {
    id: 3,
    name: 'Ekoil Diesel Ultra',
    subtitle: '5W-30 C2/C3',
    img: ekoilTara3,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  },
  {
    id: 4,
    name: 'Ekoil Ulatra Premium',
    subtitle: '5W-40 SN/CF',
    img: ekoilTara4,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  },
  {
    id: 5,
    name: 'Ekoil Sprinter',
    subtitle: '5W-30 C3',
    img: ekoilTara2,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  },
  {
    id: 6,
    name: 'Ekoil Asura',
    subtitle: 'RX 5W-30 ILSAC GF 5',
    img: ekoilTara,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  },
  {
    id: 7,
    name: 'Ekoil Sprinter',
    subtitle: '5W-30 C3',
    img: ekoilTara2,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  },
  {
    id: 8,
    name: 'Ekoil Diesel Ultra',
    subtitle: '5W-30 C2/C3',
    img: ekoilTara3,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  },
  {
    id: 9,
    name: 'Ekoil Ulatra Premium',
    subtitle: '5W-40 SN/CF',
    img: ekoilTara4,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  },
  {
    id: 10,
    name: 'Ekoil Sprinter',
    subtitle: '5W-30 C3',
    img: ekoilTara2,
    description:
      'Синтетическое моторное масло для круглогодичного применения в бензиновых и дизельных двигателях, оборудованных турбонаддувом и устройствами доочистки выхлопных газов (каталитическими нейтрализаторами и фильтрами сажевых частиц (DPF)). Соответствует жестким требованиям автопроизводителей по снижению выбросов в атмосферу и обеспечивает отличные эксплуатационные характеристики.'
  }
];

export const CATEGORIES = [
  {
    id: 'M',
    // title: 'Легковой транспорт',
    title: 'Моторные масла',
    fullTitle: 'Для легкового транспорта',
    // value: 'passenger',
    // value: 'motor_oils',
    value: 'M',
    icon: Car,
    iconWidth: '45',
    iconHeight: '40'
  },
  {
    id: 'T',
    // title: 'Коммерческий транспорт',
    title: 'Трансмиссионные масла',
    fullTitle: 'Для коммерческого транспорта',
    // value: 'commercial',
    // value: 'transmission_oils',
    value: 'T',
    icon: TransmissionIcon,
    iconWidth: '30',
    iconHeight: '30'
  },
  {
    id: 'I',
    // title: 'Спец. техника',
    title: 'Индустриальные масла',
    fullTitle: 'Для специальной техники',
    // value: 'special',
    // value: 'industrial_oils',
    value: 'I',
    icon: IndustryIcon,
    iconWidth: '28',
    iconHeight: '28'
  },
  // {
  //   id: 5,
  //   title: 'Для индустрии',
  //   fullTitle: 'Для индустрии',
  //   value: 'industry',
  //   icon: IndustryIcon,
  //   iconWidth: '30',
  //   iconHeight: '35'
  // },
  {
    id: 'A',
    title: 'Антифризы',
    fullTitle: 'Антифризы',
    // value: 'antifreeze',
    // value: 'antifreezes',
    value: 'A',
    icon: AntiFreezeIcon,
    iconWidth: '35',
    iconHeight: '35'
  }
];
