import React from 'react';
import { Box, Typography } from '@mui/material';

export default function Company() {
  return (
    <Box>
      <Typography variant="subtitle1">
        Компания Экойл крупнейший производитель смазочных материалов EKOIL, который прошел путь от маленького
        кооператива до крупного предприятия, обладающего технологической и производственной базой выпуска широкого
        ассортимента продукции. Более чем за 20 летний опыт работы (предприятие основано в 1995 г.) нами накоплен
        огромный опыт разработки и внедрения инновационных продуктов, отвечающих требованиям ведущих производителей
        техники.
      </Typography>
    </Box>
  );
}
