import React from 'react';
import { Box, Typography } from '@mui/material';

export default function WhyWe() {
  return (
    <Box>
      <Typography variant="subtitle1">
        <ul>
          <li>
            Масла EKOIL выпускаются на собственной производственной площадке и имеет одобрения и допуски ведущих
            производителей техники.
          </li>
          <li>
            Наша продукция поставляется на сборочные конвейеры производителей техники ПАО "КАМАЗ", АО "Русская
            механика", на крупные промышленные предприятия, в розничные сети, СТО, а также интернет-магазины.
          </li>
          <li>Более 20 лет на рынке</li>
        </ul>
      </Typography>
    </Box>
  );
}
